Repository: ThinkInAIXYZ/clawdhome
Catalog: ClawdHome/Stable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

# wizard.base_env.permission_desc
source: 安装阶段会自动处理 Node.js / npm 环境 / openclaw。 这些细节统一归为「基础环境初始化」。
en: The installation phase automatically handles Node.js / npm environment / openclaw. These details are grouped under "Base Environment Initialization".
zh_hant: 寫入角色檔案失敗：%@

# wizard.base_env.repair_homebrew_permission
source: 修复 Homebrew 权限
en: Repair Homebrew Permissions
zh_hant: 缺失原因：%@

# wizard.base_env.repair_homebrew_permission_done
source: Homebrew 权限修复完成：已安装/更新 ~/.brew，并写入 ~/.zprofile 环境变量。
en: Homebrew permission repair completed: installed/updated ~/.brew and wrote environment variables to ~/.zprofile.
zh_hant: 檢測到 Node.js 環境缺失，等待修復確認。

# wizard.base_env.running.keep_open
source: 一般安装过程在 1～3 分钟，完成后会自动进入下一步。
en: Keep this window open. It will move to the next step automatically when done.
zh_hant: 代理未啟用：將使用直連網路

# wizard.base_env.running.status.dependencies
source: 正在下载依赖…
en: Downloading dependencies…
zh_hant: 代理已啟用：%@://%@:%@

# wizard.base_env.running.status.runtime
source: 正在准备运行环境…
en: Preparing runtime environment…
zh_hant: 代理已啟用，但 host/port 配置不完整：將跳過代理注入

# wizard.base_env.running.status.system
source: 正在检查系统配置…
en: Checking system configuration…
zh_hant: 代理配置同步失敗（不影響初始化）：%@

# wizard.base_env.running.subtitle
source: 正在安装依赖，请稍候..
en: Installing dependencies. Please wait..
zh_hant: 已同步代理配置到當前蝦環境

# wizard.base_env.running.title
source: 基础环境初始化
en: Base environment initialization
zh_hant: 基礎環境修復完成，等待手動再次啟動。

# wizard.base_env.set_npm_registry
source: 设置 npm 安装源
en: Set npm Registry
zh_hant: Node.js 修復失敗：%@

# wizard.base_env.setup_npm_env
source: 配置 npm 目录
en: Configure npm Directory
zh_hant: 正在執行基礎環境修復…

# wizard.base_env.subtitle
source: 安装 Node.js / npm 环境与 openclaw 核心组件。
en: Install Node.js / npm environment and openclaw core components.
zh_hant: 正在啟動 Gateway…

# wizard.base_env.title
source: 基础环境初始化
en: Base environment initialization
zh_hant: 遷移舊初始化狀態失敗：%@

# wizard.base_env.xcode_check
source: 检查 Xcode 开发环境
en: Check Xcode Development Environment
zh_hant: 重置初始化狀態失敗：%@

# wizard.channel.more_im_bindings
source: 更多 IM 频道绑定
en: More IM channel bindings
zh_hant: 儲存初始化狀態失敗：%@

# wizard.channel.more_im_bindings_hint
source: 通过 openclaw 原生配置界面进行操作。
en: Use the native openclaw configuration interface.
zh_hant: 修復完成，等待再次啟動

# wizard.channel.native_config.window_title
source: IM 频道原生配置
en: Native IM channel configuration
zh_hant: 執行健康檢查修復

# wizard.channel.pairing_detected_continue_hint
source: 检测到 %@ 配对成功。确认通道设置后，点击“完成”继续。
en: %@ pairing detected. Review channel settings, then click Done to continue.
zh_hant: 修復 Homebrew 許可權

# wizard.custom.api_compatibility
source: API 兼容（默认 OpenAI）
en: API compatibility (default: OpenAI)
zh_hant: 安裝/修復 Node.js

# wizard.custom.base_url
source: 基础 URL
en: Base URL
zh_hant: 基礎 URL

# wizard.custom.compatibility_picker
source: 兼容类型
en: Compatibility
zh_hant: 配置 npm 目錄

# wizard.custom.model_alias
source: 模型ID别名
en: Model alias
zh_hant: 正在啟動 Gateway

# wizard.custom.model_alias_placeholder
source: 例如：自定义 GPT-4.1
en: For example: Custom GPT-4.1
zh_hant: 身份設定

# wizard.custom.model_id
source: 模型ID
en: Model ID
zh_hant: 儲存並繼續

# wizard.custom.model_id_placeholder
source: 例如 gpt-5.5 / claude-opus-4-7
en: e.g. gpt-5.5 / claude-opus-4-7
zh_hant: 儲存中…

# wizard.custom.secret_reference
source: 密钥引用
en: Secret Reference
zh_hant: 核心價值觀

# wizard.custom.suggested_models
source: 可选模型
en: Suggested Models
zh_hant: 我的畫像

# wizard.gateway.node_missing.message
source: 将执行基础环境修复。修复完成后，请手动点击“再次启动 Gateway”。
en: We will run a base environment repair. After completion, click "Start Gateway again" manually.
zh_hant: 安裝 openclaw (%@)

# wizard.gateway.node_missing.title
source: 检测到 Node.js 环境缺失
en: Node.js environment missing
zh_hant: ## 共享資料夾

# wizard.gateway.repair.close
source: 关闭
en: Close

# wizard.gateway.repair.current_step
source: 当前步骤：%@
en: Current step: %@
zh_hant: 你有兩個檔案共享空間可以使用。

# wizard.gateway.repair.in_progress
source: 修复中…
en: Repairing…
zh_hant: 請先填寫 custom-base-url。

# wizard.gateway.repair.progress
source: 修复进度：%d/4
en: Repair progress: %d/4
zh_hant: 請先填寫 custom-model-id。

# wizard.gateway.repair.reason
source: 触发原因：%@
en: Trigger reason: %@
zh_hant: Secret Reference 不能為空。

# wizard.gateway.repair.retry_start
source: 再次启动 Gateway
en: Start Gateway again
zh_hant: 環境變數 %@ 未配置（預檢失敗）。

# wizard.gateway.repair.start
source: 开始修复
en: Start repair
zh_hant: env 引用格式錯誤。示例：env:CUSTOM_API_KEY

# wizard.homebrew.repair.done
source: Homebrew 权限修复已完成
en: Homebrew permission repair completed
zh_hant: 環境變數引用格式錯誤。示例：${CUSTOM_API_KEY}

# wizard.homebrew.repair.failed
source: Homebrew 权限修复失败（已跳过，不影响初始化）
en: Homebrew permission repair failed (skipped, init continues)
zh_hant: 未輸入 custom API Key，且 env.CUSTOM_API_KEY 未配置。

# wizard.homebrew.repair.start
source: 修复 Homebrew 权限（可选）
en: Repair Homebrew permissions (optional)
zh_hant: provider ref %@ 不存在於全域性 secrets（預檢失敗）。

# wizard.inject_role.subtitle
source: 定义角色的核心价值观、身份设定和画像。留空则保留默认设定。
en: Define core values, identity, and profile for the role. Leave blank to keep defaults.
zh_hant: Secret Reference 格式不支援。請使用 env:VAR / ${VAR} / provider:account。

# wizard.inject_role.title
source: 注入角色
en: Inject Role
zh_hant: Xcode 工具鏈未就緒：%@

# wizard.log_output
source: 日志输出
en: Logs
zh_hant: 從當前進度繼續

# wizard.model_config.advanced_settings
source: 高级设置
en: Advanced
zh_hant: 開始初始化

# wizard.model_config.api_protocol
source: 接口协议
en: API Protocol
zh_hant: 終止初始化

# wizard.model_config.auth_method
source: 认证方式
en: Auth Method
zh_hant: 正在終止…

# wizard.model_config.command.alert.closed_message
source: 命令行窗口已关闭，这一步可能尚未完成。若确认配置已经完成，仍可继续下一步。
en: The terminal window was closed. This step may be incomplete. If you already finished configuration, you can continue.
zh_hant: 認證方式

# wizard.model_config.command.alert.detected_message
source: 检测到模型配置已生效。你可以继续下一步。
en: Detected that model configuration appears complete. You can proceed.
zh_hant: 關於許可權

# wizard.model_config.command.alert.detected_title
source: 检测到模型配置
en: Model Configuration Detected
zh_hant: 修復 Homebrew 許可權

# wizard.model_config.command.alert.failed_message
source: 命令行执行失败或中断。你可以重新打开命令行继续配置。
en: Terminal command failed or was interrupted. You can reopen terminal and retry.
zh_hant: 安裝 Node.js

# wizard.model_config.command.alert.incomplete_title
source: 模型步骤可能未完成
en: Model Step May Be Incomplete
zh_hant: 安裝 openclaw

# wizard.model_config.command.alert.success_message
source: 命令行窗口已正常退出，但当前还没检测到默认模型。若你已经在命令行里完成了需要的配置，可以继续下一步。
en: Terminal exited normally, but no default model is detected yet. If you've completed configuration, you can still continue.
zh_hant: 安裝階段會自動處理 Node.js / npm 環境 / openclaw。

# wizard.model_config.command.alert.success_title
source: 命令已执行完成
en: Command Completed

# wizard.model_config.command.confirm_complete
source: 标记已完成并继续
en: Mark Complete and Continue
zh_hant: 這些細節統一歸為「基礎環境初始化」。

# wizard.model_config.command.desc
source: 也可以直接打开命令行执行 `openclaw configure --section model`。关闭窗口后，向导会确认这一步是否完成。
en: You can also open terminal and run `openclaw configure --section model` directly. After closing terminal, the wizard will verify completion.
zh_hant: 修復 Homebrew 許可權

# wizard.model_config.command.group
source: 高阶方式
en: Advanced Method
zh_hant: Homebrew 許可權修復完成：已安裝/更新 ~/.brew，並寫入 ~/.zprofile 環境變數。

# wizard.model_config.command.open
source: 通过命令行配置
en: Configure via Terminal
zh_hant: 一般安裝過程在 1～3 分鐘，完成後會自動進入下一步。

# wizard.model_config.command.open_hint
source: 命令行配置窗口已打开。完成或取消后关闭窗口，这里会提示是否进入下一步。
en: Terminal config window is open. Close it after finishing or canceling, then this step will prompt for next action.
zh_hant: 正在下載依賴…

# wizard.model_config.command.reopen
source: 命令行窗口已打开
en: Terminal Window Opened
zh_hant: 正在準備執行環境…

# wizard.model_config.command.stay_on_step
source: 留在当前步骤
en: Stay on Current Step
zh_hant: 正在檢查系統配置…

# wizard.model_config.command.window_title
source: 模型配置命令行
en: Model Configuration Terminal
zh_hant: 正在安裝依賴，請稍候..

# wizard.model_config.custom_compatibility_hint
source: 自定义支持 `openai` / `anthropic` 兼容类型；默认 `openai`。
en: Custom mode supports `openai` / `anthropic` compatibility; default is `openai`.
zh_hant: 基礎環境初始化

# wizard.model_config.custom_provider_id_placeholder
source: providerId (可选 custom-provider-id)
en: providerId (optional: custom-provider-id)
zh_hant: 設定 npm 安裝源

# wizard.model_config.secret_reference_hint
source: 支持 `env:VAR` / `${VAR}` / `provider:accountName`。应用前会做预检查。
en: Supports `env:VAR` / `${VAR}` / `provider:accountName`. A pre-check runs before apply.
zh_hant: 配置 npm 目錄

# wizard.model_config.secret_reference_placeholder
source: env:MY_API_KEY 或 provider:accountName
en: env:MY_API_KEY or provider:accountName
zh_hant: 安裝 Node.js / npm 環境與 openclaw 核心元件。

# wizard.model_config.skip
source: 稍后配置
en: Configure Later
zh_hant: 基礎環境初始化

# wizard.model_config.validate_continue
source: 验证并继续
en: Validate and continue
zh_hant: 檢查 Xcode 開發環境

# wizard.model_config.validating
source: 验证中…
en: Validating…
zh_hant: 更多 IM 頻道繫結

# wizard.model_config.validation.empty_key
source: 请先输入 API Key，再执行验证。
en: Enter an API key before validation.
zh_hant: 透過 openclaw 原生配置介面進行操作。

# wizard.model_config.validation.failed
source: Provider 验证失败，请检查配置后重试。
en: Provider validation failed. Check your configuration and try again.
zh_hant: IM 頻道原生配置

# wizard.model_config.validation.failed_generic
source: 验证失败，未收到 Provider 返回信息。
en: Validation failed: no response from provider.
zh_hant: 檢測到 %@ 配對成功。確認通道設定後，點選“完成”繼續。

# wizard.model_config.validation.idle
source: 未验证。点击“验证并继续”后会执行实时连通性检查。
en: Not validated yet. Click "Validate and continue" to run a real-time connectivity check.
zh_hant: API 相容（預設 OpenAI）

# wizard.model_config.validation.running
source: 正在验证 Provider 配置…
en: Validating provider configuration…
zh_hant: 相容型別

# wizard.model_config.validation.subtitle
source: 选择模型提供商并填写认证信息。验证成功后才会进入下一步。
en: Select a model provider and fill in credentials. You can continue only after validation succeeds.
zh_hant: 模型ID別名

# wizard.model_config.validation.success_provider
source: %@ 验证成功，正在进入下一步。
en: %@ validated successfully. Moving to the next step.
zh_hant: 例如：自定義 GPT-4.1

# wizard.openclaw_version.custom
source: 指定版本
en: Specific version
zh_hant: 模型ID

# wizard.openclaw_version.custom_placeholder
source: 例如：2026.3.12
en: Example: 2026.3.12
zh_hant: 例如 gpt-5.5 / claude-opus-4-7

# wizard.openclaw_version.group
source: OpenClaw 版本
en: OpenClaw Version
zh_hant: 金鑰引用

# wizard.openclaw_version.install_target
source: 初始化将安装版本：%@
en: Initialization will install version: %@
zh_hant: 可選模型

# wizard.openclaw_version.latest
source: 最新版本
en: Latest Version
zh_hant: 將執行基礎環境修復。修復完成後，請手動點選“再次啟動 Gateway”。

# wizard.openclaw_version.picker
source: OpenClaw 版本
en: OpenClaw Version
zh_hant: 檢測到 Node.js 環境缺失

# wizard.provider.custom.api_key_label
source: 自定义 API Key
en: Custom API Key
zh_hant: 關閉

# wizard.provider.custom.api_key_placeholder
source: 留空则使用 CUSTOM_API_KEY
en: Leave empty to use CUSTOM_API_KEY
zh_hant: 當前步驟：%@

# wizard.provider.custom.console
source: API Key 参考
en: API Key Reference
zh_hant: 修復中…

# wizard.provider.custom.name
source: 自定义
en: Custom
zh_hant: 修復進度：%d/4

# wizard.provider.custom.subtitle
source: OpenAI / Anthropic 兼容
en: OpenAI / Anthropic Compatible
zh_hant: 觸發原因：%@

# wizard.provider.kimi.console
source: Kimi Code 控制台
en: Kimi Code Console
zh_hant: 再次啟動 Gateway

# wizard.provider.label
source: 模型提供商
en: Model provider
zh_hant: 開始修復

# wizard.provider.minimax.api_key.placeholder
source: 粘贴 MiniMax API Key
en: Paste MiniMax API Key
zh_hant: Homebrew 許可權修復已完成

# wizard.provider.minimax.console
source: MiniMax 控制台
en: MiniMax Console
zh_hant: Homebrew 許可權修復失敗（已跳過，不影響初始化）

# wizard.provider.minimax.promotion
source: 🎁 领取 9 折专属优惠
en: 🎁 Get exclusive 10% off
zh_hant: 修復 Homebrew 許可權（可選）

# wizard.provider.minimax.subtitle
source: MiniMax M2.5 系列
en: MiniMax M2.5 Series
zh_hant: 定義角色的核心價值觀、身份設定和畫像。留空則保留預設設定。

# wizard.provider.more_models_openclaw_native
source: 更多模型（openclaw原生配置）
en: More models (openclaw native configuration)
zh_hant: 注入角色

# wizard.provider.no_results
source: 未找到匹配项
en: No matching results
zh_hant: 日誌輸出

# wizard.provider.qiniu.console
source: 七牛 API Key
en: Qiniu API Key
zh_hant: 高階設定

# wizard.provider.qiniu.promotion
source: 免费领取 1000 万 Token
en: Get 10 million free tokens
zh_hant: 介面協議

# wizard.provider.search
source: 搜索 Provider...
en: Search Provider...
zh_hant: 認證方式

# wizard.provider.zai.api_key_label
source: 智谱 API Key
en: Zhipu API Key
zh_hant: 命令列視窗已關閉，這一步可能尚未完成。若確認配置已經完成，仍可繼續下一步。

# wizard.provider.zai.console
source: 获取 API Key
en: Get API Key
zh_hant: 檢測到模型配置已生效。你可以繼續下一步。

# wizard.provider.zai.name
source: 智谱 Z.AI
en: Zhipu Z.AI
zh_hant: 檢測到模型配置

# wizard.provider.zai.promotion
source: 95折优惠订阅
en: 5% off subscription
zh_hant: 命令列執行失敗或中斷。你可以重新開啟命令列繼續配置。

# wizard.provider.zai.subtitle
source: GLM系列模型
en: GLM Series Models
zh_hant: 模型步驟可能未完成

# wizard.resume_state.loading
source: 正在恢复初始化状态…
en: Restoring initialization state...
zh_hant: 命令列視窗已正常退出，但當前還沒檢測到預設模型。若你已經在命令列裡完成了需要的配置，可以繼續下一步。

# wizard.step.basic_environment
source: 基础环境
en: Base Environment
zh_hant: 命令已執行完成

# wizard.step.configure_channel
source: IM 绑定
en: IM Binding
zh_hant: 標記已完成並繼續

# wizard.step.configure_model
source: 模型配置
en: Model Configuration
zh_hant: 也可以直接開啟命令列執行 `openclaw configure --section model`。關閉視窗後，嚮導會確認這一步是否完成。

# wizard.step.finish
source: 完成
en: Done
zh_hant: 高階方式

# wizard.step.inject_role
source: 注入角色
en: Inject Role
zh_hant: 透過命令列配置

# wizard.subtitle.configuring
source: 正在配置生存空间
en: Configuring habitat
zh_hant: 命令列配置視窗已開啟。完成或取消後關閉視窗，這裡會提示是否進入下一步。

# wizard.title
source: 初始化 · %@
en: Initialize · %@
zh_hant: 命令列視窗已開啟

# common.action.confirm
source: 确定
en: OK
zh_hant: 留在當前步驟

# common.action.close
source: 关闭
en: Close
zh_hant: 模型配置命令列

# common.action.delete
source: 删除
en: Delete
zh_hant: 自定義支援 `openai` / `anthropic` 相容型別；預設 `openai`。

# common.action.save
source: 保存
en: Save
zh_hant: providerId (可選 custom-provider-id)

# common.action.rename
source: 重命名
en: Rename
zh_hant: 支援 `env:VAR` / `${VAR}` / `provider:accountName`。應用前會做預檢查。

# common.action.start
source: 启动
en: Start
zh_hant: env:MY_API_KEY 或 provider:accountName

# common.action.stop
source: 停止
en: Stop
zh_hant: 稍後配置

# common.action.restart
source: 重启
en: Restart
zh_hant: 驗證並繼續

# common.action.close_tab
source: 关闭标签
en: Close Tab
zh_hant: 驗證中…

# common.action.done
source: 完成
en: Done
zh_hant: 請先輸入 API Key，再執行驗證。

# common.action.refresh
source: 刷新状态
en: Refresh Status
zh_hant: Provider 驗證失敗，請檢查配置後重試。

# common.action.delete_user
source: 删除用户
en: Delete User
zh_hant: 驗證失敗，未收到 Provider 返回資訊。

# common.label.name
source: 名称
en: Name
zh_hant: 未驗證。點選“驗證並繼續”後會執行即時連通性檢查。

# common.label.terminal
source: 终端
en: Terminal
zh_hant: 正在驗證 Provider 配置…

# common.label.autostart
source: 开机启动
en: Launch at Login
zh_hant: 選擇模型提供商並填寫認證資訊。驗證成功後才會進入下一步。

# common.label.overview
source: 概览
en: Overview
zh_hant: %@ 驗證成功，正在進入下一步。

# common.action.start_all
source: 全部启动
en: Start All
zh_hant: 指定版本

# common.action.stop_all
source: 全部停止
en: Stop All
zh_hant: 例如：2026.3.12

# common.error.action_failed
source: 操作失败
en: Action Failed
zh_hant: OpenClaw 版本

# hermes.profile.new_profile
source: 新建 Profile
en: New Profile
zh_hant: 初始化將安裝版本：%@

# hermes.profile.close_chat_tab_title
source: 关闭会话标签？
en: Close Chat Tab?
zh_hant: 最新版本

# hermes.profile.close_chat_tab_message
source: 关闭后该标签中的 Hermes 会话会被终止，无法恢复。
en: Closing this tab will terminate the Hermes session and cannot be undone.
zh_hant: OpenClaw 版本

# hermes.profile.delete_title
source: 删除 Profile？
en: Delete Profile?
zh_hant: 自定義 API Key

# hermes.profile.delete_message
source: 删除后该 profile 的会话和配置不可恢复。
en: The profile's sessions and configuration cannot be recovered.
zh_hant: 留空則使用 CUSTOM_API_KEY

# hermes.profile.empty
source: 暂无 profile
en: No Profiles
zh_hant: API Key 參考

# hermes.profile.set_current
source: 设为当前
en: Set as Current
zh_hant: 自定義

# hermes.profile.continue_binding
source: 继续绑定 (%d)
en: Continue Binding (%d)
zh_hant: OpenAI / Anthropic 相容

# hermes.chat.empty_hint
source: 点击下方按钮开始与 Hermes 对话
en: Click the button below to start chatting with Hermes
zh_hant: Kimi Code 控制檯

# hermes.chat.start_session
source: 启动会话
en: Start Session
zh_hant: 模型提供商

# hermes.chat.new_tab
source: 新建会话标签
en: New Session Tab
zh_hant: 貼上 MiniMax API Key

# hermes.chat.helper_session
source: Helper 会话
en: Helper Session
zh_hant: MiniMax 控制檯

# hermes.status.running_pid
source: 运行中 PID %d
en: Running PID %d
zh_hant: 🎁 領取 9 折專屬優惠

# hermes.status.running
source: 运行中
en: Running
zh_hant: MiniMax M2.5 系列

# hermes.status.stopped
source: 已停止
en: Stopped
zh_hant: 更多模型（openclaw原生配置）

# hermes.terminal.empty_hint
source: 点击下方按钮打开终端会话
en: Click the button below to open a terminal session
zh_hant: 未找到匹配項

# hermes.terminal.open
source: 打开终端
en: Open Terminal
zh_hant: 七牛 API Key

# hermes.terminal.close_tab_title
source: 关闭终端标签？
en: Close Terminal Tab?
zh_hant: 免費領取 1000 萬 Token

# hermes.terminal.close_tab_message
source: 关闭后该终端会话将被终止，无法恢复。
en: Closing this tab will terminate the terminal session and cannot be undone.
zh_hant: 搜尋 Provider...

# hermes.terminal.new_tab
source: 新建终端标签
en: New Terminal Tab
zh_hant: 智譜 API Key

# hermes.terminal.stop_with_terminals_title
source: 有 %d 个终端会话正在运行
en: %d Terminal Sessions Are Running
zh_hant: 獲取 API Key

# hermes.terminal.close_and_stop
source: 关闭终端并停止
en: Close Terminals and Stop
zh_hant: 智譜 Z.AI

# hermes.terminal.stop_message
source: 停止 Hermes 将终止所有打开的终端会话，无法恢复。
en: Stopping Hermes will terminate all open terminal sessions and cannot be undone.
zh_hant: 95折優惠訂閱

# hermes.action.stop
source: 停止 Hermes
en: Stop Hermes
zh_hant: GLM系列模型

# hermes.action.health_check
source: 体检
en: Health Check
zh_hant: 正在恢復初始化狀態…

# hermes.action.settings
source: Hermes 设置
en: Hermes Settings
zh_hant: 基礎環境

# hermes.sidebar.team_init
source: 团队初始化
en: Team Setup
zh_hant: IM 繫結

# hermes.delete.confirm_title
source: 确认删除 @%@？
en: Confirm Deleting @%@?
zh_hant: 模型配置

# hermes.delete.confirm_message
source: 此操作不可撤销，将删除该用户的所有数据。
en: This action cannot be undone and will delete all data for this user.
zh_hant: 完成

# hermes.setup.not_installed
source: 未安装
en: Not Installed
zh_hant: 注入角色

# hermes.setup.status_title
source: Hermes 状态
en: Hermes Status
zh_hant: 正在配置生存空間

# hermes.setup.description
source: Hermes Agent 是一个自进化 AI 代理框架，支持 20+ 消息平台，需要 Python 3.11+。
en: Hermes Agent is a self-evolving AI agent framework supporting 20+ messaging platforms, requiring Python 3.11+.
zh_hant: 初始化 · %@

# hermes.setup.install_steps
source: 安装步骤：1) 修复 Homebrew 权限 2) 安装 Hermes Agent
en: Installation steps: 1) Fix Homebrew permissions 2) Install Hermes Agent
zh_hant: 確定

# hermes.setup.installing
source: 安装中…
en: Installing...
zh_hant: 關閉

# hermes.setup.install_action
source: 安装 Hermes Agent
en: Install Hermes Agent
zh_hant: 刪除

# hermes.setup.install_button
source: 安装
en: Install
zh_hant: 儲存

# hermes.setup.install_done
source: 安装完成，请配置 API 密钥后启动 Gateway。
en: Installation complete. Configure your API key and start the gateway.
zh_hant: 重新命名

# hermes.setup.config_hint
source: 用于生成 ~/.hermes/config.yaml 与 ~/.hermes/.env
en: Used to generate ~/.hermes/config.yaml and ~/.hermes/.env
zh_hant: 啟動

# hermes.setup.read_config
source: 读取当前配置
en: Read Current Config
zh_hant: 停止

# hermes.setup.base_url_optional
source: Base URL (可选)
en: Base URL (Optional)
zh_hant: 重啟

# hermes.setup.primary_key_var
source: 主密钥变量名
en: Primary Key Variable Name
zh_hant: 關閉標籤

# hermes.setup.primary_key_value
source: 主密钥值
en: Primary Key Value
zh_hant: 完成

# hermes.setup.extra_env_vars
source: 附加环境变量（每行 KEY=VALUE）
en: Additional Environment Variables (KEY=VALUE per line)
zh_hant: 重新整理狀態

# hermes.setup.existing_env_keys
source: 已存在变量：%@
en: Existing variables: %@
zh_hant: 刪除使用者

# hermes.setup.validate_config
source: 校验配置
en: Validate Config
zh_hant: 名稱

# hermes.setup.apply_config
source: 应用配置
en: Apply Config
zh_hant: 終端

# hermes.setup.init_config
source: 初始化配置
en: Initialize Config
zh_hant: 開機啟動

# hermes.setup.gateway_control_title
source: Gateway 控制
en: Gateway Control
zh_hant: 概覽

# hermes.setup.cli_hint
source: 在维护终端中使用 Hermes CLI（独立环境，不含 Node.js/npm）。
en: Use Hermes CLI in a maintenance terminal (standalone environment, without Node.js/npm).
zh_hant: 全部啟動

# hermes.setup.maintenance_terminal
source: 维护终端
en: Maintenance Terminal
zh_hant: 全部停止

# hermes.qr_binding.scan_required
source: 需要在终端内完成扫码授权
en: QR code authorization must be completed in the terminal
zh_hant: 操作失敗

# hermes.qr_binding.flow_title
source: 扫码流程说明
en: QR Code Flow
zh_hant: 新建 Profile

# hermes.qr_binding.open_terminal
source: 打开扫码终端
en: Open QR Terminal
zh_hant: 關閉會話標籤？

# hermes.qr_binding.defer
source: 稍后完成
en: Complete Later
zh_hant: 關閉後該標籤中的 Hermes 會話會被終止，無法恢復。

# hermes.qr_binding.terminal_opened
source: 终端已打开，请在终端窗口完成扫码
en: Terminal opened, please complete QR scan in the terminal window
zh_hant: 刪除 Profile？

# hermes.qr_binding.scan_instruction
source: 完成后回到此页面点【我已扫完】进行验证。若 5 分钟内未确认，本步骤将自动标为【稍后完成】。
en: After scanning, return to this page and click [I'm Done Scanning] to verify. If not confirmed within 5 minutes, this step will be automatically marked as [Complete Later].
zh_hant: 刪除後該 profile 的會話和配置不可恢復。

# hermes.qr_binding.verify
source: 我已扫完（验证）
en: I'm Done Scanning (Verify)
zh_hant: 暫無 profile

# hermes.qr_binding.reopen
source: 重新打开终端
en: Reopen Terminal
zh_hant: 設為當前

# hermes.qr_binding.verifying
source: 正在通过 hermes doctor 验证连接…
en: Verifying connection via hermes doctor...
zh_hant: 繼續繫結 (%d)

# hermes.qr_binding.verified
source: 验证通过！
en: Verification Passed!
zh_hant: 點選下方按鈕開始與 Hermes 對話

# hermes.qr_binding.retry
source: 再扫一次
en: Scan Again
zh_hant: 啟動會話

# hermes.team_wizard.loading
source: 正在读取初始化进度…
en: Loading initialization progress...
zh_hant: 新建會話標籤

# hermes.team_wizard.prev_step
source: 上一步
en: Previous
zh_hant: Helper 會話

# hermes.team_wizard.skip_profile
source: 跳过此 profile
en: Skip This Profile
zh_hant: 執行中 PID %d

# hermes.team_wizard.not_installed
source: Hermes 未安装
en: Hermes Not Installed
zh_hant: 執行中

# hermes.team_wizard.installing
source: 安装中…
en: Installing...
zh_hant: 已停止

# hermes.team_wizard.install_action
source: 安装 Hermes Agent
en: Install Hermes Agent
zh_hant: 點選下方按鈕開啟終端會話

# hermes.team_wizard.install_done_next
source: 已安装，正在进入下一步…
en: Installed, proceeding to next step...
zh_hant: 開啟終端

# hermes.team_wizard.hermes_status
source: Hermes 状态
en: Hermes Status
zh_hant: 關閉終端標籤？

# hermes.team_wizard.members_hint
source: 为每个 Hermes Agent 设置唯一 ID、显示名和 Emoji。main（默认角色）始终保留。
en: Set a unique ID, display name, and emoji for each Hermes Agent. main (default role) is always retained.
zh_hant: 關閉後該終端會話將被終止，無法恢復。

# hermes.team_wizard.display_name
source: 显示名
en: Display Name
zh_hant: 新建終端標籤

# hermes.team_wizard.add_member
source: 添加成员
en: Add Member
zh_hant: 有 %d 個終端會話正在執行

# hermes.team_wizard.creating_profile
source: 正在创建 profile…
en: Creating profile...
zh_hant: 關閉終端並停止

# hermes.team_wizard.id_invalid
source: ID 格式不合法（小写字母/数字，2-64位）
en: Invalid ID format (lowercase letters/digits, 2–64 chars)
zh_hant: 停止 Hermes 將終止所有開啟的終端會話，無法恢復。

# hermes.team_wizard.id_exists
source: ID 已存在
en: ID Already Exists
zh_hant: 停止 Hermes

# hermes.team_wizard.llm_hint
source: 以下配置将写入所有团队成员的 config.yaml 与 .env。
en: The following configuration will be written to all team members' config.yaml and .env.
zh_hant: 體檢

# hermes.team_wizard.base_url_optional
source: Base URL（可选）
en: Base URL (Optional)
zh_hant: Hermes 設定

# hermes.team_wizard.primary_key_var
source: 主密钥变量名
en: Primary Key Variable Name
zh_hant: 團隊初始化

# hermes.team_wizard.key_value
source: 密钥值
en: Key Value
zh_hant: 確認刪除 @%@？

# hermes.team_wizard.provider_model_required
source: Provider 与 Model 不能为空
en: Provider and Model are required
zh_hant: 此操作不可撤銷，將刪除該使用者的所有資料。
